<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"b90962d538a6e67f0f1a397625a20549524f7964b44404f30fe45538866683d0","plan_job_ref":"Job Environment Main - Plan #1755 at https://github.com/jarrod-lowe/wildsea/actions/runs/17965467665","plan_out_hash":"48a3983ea1adb677967ab572a4be0ce0739eb277fe11d2e9ab72ca43ccc26e20","plan_hash":"1787a646edf235f94b951257a1cdaa71d0e0369b4749cef3d9e8070d42824929","plan_text_format":"diff","version":"2.2.2"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
domain_name          = "wildsea.lowe.kiwi"
environment          = "primary"
google_client_id     = (sensitive value)
google_client_secret = (sensitive value)
saml_metadata_url    = (sensitive value)
sns_alarm_topic_arn  = "arn:aws:sns:ap-southeast-2:453430506965:Pushover"
```
</details>
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.wildsea.aws_cloudwatch_metric_alarm.rum_error_rate[0] will be created
+   resource "aws_cloudwatch_metric_alarm" "rum_error_rate" {
+       actions_enabled                       = true
+       alarm_actions                         = [
+           "arn:aws:sns:ap-southeast-2:453430506965:Pushover",
        ]
+       alarm_description                     = "This metric monitors RUM JavaScript errors per session - alerts when more than 0.1 errors per session occur"
+       alarm_name                            = "Wildsea-primary-rum-high-error-rate"
+       arn                                   = (known after apply)
+       comparison_operator                   = "GreaterThanThreshold"
+       dimensions                            = {
+           "application_name" = "Wildsea-primary-rum"
        }
+       evaluate_low_sample_count_percentiles = (known after apply)
+       evaluation_periods                    = 1
+       id                                    = (known after apply)
+       metric_name                           = "JsErrorCountPerSession"
+       namespace                             = "AWS/RUM"
+       ok_actions                            = [
+           "arn:aws:sns:ap-southeast-2:453430506965:Pushover",
        ]
+       period                                = 300
+       region                                = "ap-southeast-2"
+       statistic                             = "Average"
+       tags                                  = {
+           "Environment" = "Wildsea-primary"
+           "Name"        = "Wildsea-primary-rum-high-error-rate"
        }
+       tags_all                              = {
+           "Application" = "Wildsea-primary"
+           "Environment" = "Wildsea-primary"
+           "Name"        = "Wildsea-primary-rum-high-error-rate"
        }
+       threshold                             = 0.1
+       treat_missing_data                    = "notBreaching"
    }

  # module.wildsea.aws_cloudwatch_metric_alarm.rum_http_4xx_errors[0] will be created
+   resource "aws_cloudwatch_metric_alarm" "rum_http_4xx_errors" {
+       actions_enabled                       = true
+       alarm_actions                         = [
+           "arn:aws:sns:ap-southeast-2:453430506965:Pushover",
        ]
+       alarm_description                     = "This metric monitors RUM HTTP 4xx errors per session - alerts when more than 0.05 errors per session occur"
+       alarm_name                            = "Wildsea-primary-rum-http-4xx-errors"
+       arn                                   = (known after apply)
+       comparison_operator                   = "GreaterThanThreshold"
+       dimensions                            = {
+           "application_name" = "Wildsea-primary-rum"
        }
+       evaluate_low_sample_count_percentiles = (known after apply)
+       evaluation_periods                    = 1
+       id                                    = (known after apply)
+       metric_name                           = "Http4xxCountPerSession"
+       namespace                             = "AWS/RUM"
+       ok_actions                            = [
+           "arn:aws:sns:ap-southeast-2:453430506965:Pushover",
        ]
+       period                                = 300
+       region                                = "ap-southeast-2"
+       statistic                             = "Average"
+       tags                                  = {
+           "Environment" = "Wildsea-primary"
+           "Name"        = "Wildsea-primary-rum-http-4xx-errors"
        }
+       tags_all                              = {
+           "Application" = "Wildsea-primary"
+           "Environment" = "Wildsea-primary"
+           "Name"        = "Wildsea-primary-rum-http-4xx-errors"
        }
+       threshold                             = 0.05
+       treat_missing_data                    = "notBreaching"
    }

  # module.wildsea.aws_cloudwatch_metric_alarm.rum_navigation_duration[0] will be created
+   resource "aws_cloudwatch_metric_alarm" "rum_navigation_duration" {
+       actions_enabled                       = true
+       alarm_actions                         = [
+           "arn:aws:sns:ap-southeast-2:453430506965:Pushover",
        ]
+       alarm_description                     = "This metric monitors RUM navigation duration - alerts when p90 page load is slower than 2 seconds"
+       alarm_name                            = "Wildsea-primary-rum-slow-navigation"
+       arn                                   = (known after apply)
+       comparison_operator                   = "GreaterThanThreshold"
+       dimensions                            = {
+           "application_name" = "Wildsea-primary-rum"
        }
+       evaluate_low_sample_count_percentiles = (known after apply)
+       evaluation_periods                    = 3
+       extended_statistic                    = "p90"
+       id                                    = (known after apply)
+       metric_name                           = "PerformanceNavigationDuration"
+       namespace                             = "AWS/RUM"
+       ok_actions                            = [
+           "arn:aws:sns:ap-southeast-2:453430506965:Pushover",
        ]
+       period                                = 300
+       region                                = "ap-southeast-2"
+       tags                                  = {
+           "Environment" = "Wildsea-primary"
+           "Name"        = "Wildsea-primary-rum-slow-navigation"
        }
+       tags_all                              = {
+           "Application" = "Wildsea-primary"
+           "Environment" = "Wildsea-primary"
+           "Name"        = "Wildsea-primary-rum-slow-navigation"
        }
+       threshold                             = 2000
+       treat_missing_data                    = "notBreaching"
    }

  # module.wildsea.aws_rum_metrics_destination.main[0] will be created
+   resource "aws_rum_metrics_destination" "main" {
+       app_monitor_name = "Wildsea-primary-rum"
+       destination      = "CloudWatch"
+       id               = (known after apply)
+       region           = "ap-southeast-2"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Deprecated attribute

  on ../../module/wildsea/deleter.tf line 9, in locals:
   9:     data.aws_region.current.name,

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 6 more similar warnings elsewhere)

Warning: Invalid Attribute Combination

  with module.wildsea.aws_s3_bucket_lifecycle_configuration.ui,
  on ../../module/wildsea/ui-bucket.tf line 128, in resource "aws_s3_bucket_lifecycle_configuration" "ui":
 128: resource "aws_s3_bucket_lifecycle_configuration" "ui" {

No attribute specified when one (and only one) of
[rule[0].filter,rule[0].prefix] is required

This will be an error in a future version of the provider
```
</details>

:memo: Plan generated in [Environment Main - Plan #1755](https://github.com/jarrod-lowe/wildsea/actions/runs/17965467665)